app/Controllers/AdminController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
    private function verificarAdmin()
    {
        $userId = session()->get('id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        $usuario = $this->usuarioModel->find($userId);

SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows` FROM `departamentos`
SELECT COUNT(*) AS `numrows` FROM `personas`
SELECT *
FROM `usuarios`
SELECT *
FROM `departamentos`
---
    public function index()
    {
        $redirect = $this->verificarAdmin();
        if ($redirect) return $redirect;

        $data = [
            'title' => 'Panel de Administración',
            'totalUsuarios' => $this->usuarioModel->countAll(),
            'totalDepartamentos' => $this->departamentoModel->countAll(),
            'totalPersonas' => $this->personaModel->countAll(),
            'usuarios' => $this->usuarioModel->findAll(),
            'departamentos' => $this->departamentoModel->findAll(),

SELECT *
FROM `departamentos`
---
    public function departamentos()
    {
        $redirect = $this->verificarAdmin();
        if ($redirect) return $redirect;

        $data = [
            'title' => 'Gestión de Departamentos',
            'departamentos' => $this->departamentoModel->findAll(),

INSERT INTO `departamentos` (`nombre`, `descripcion`, `codigo`, `estado`, `created_at`, `updated_at`) VALUES ('RECEPCIÓN', 'RECEPCIÓN DE CASTILLO Y CASA MUSEO', 'RECP', 'ACTIVO', '2026-05-28 13:08:42', '2026-05-28 13:08:42')
---
    public function crearDepartamento()
    {
        $redirect = $this->verificarAdmin();
        if ($redirect) return $redirect;

        $data = [
            'title' => 'Crear Departamento',
        ];

        if ($this->request->getMethod() === 'POST') {
            $codigo = strtoupper($this->request->getPost('codigo'));

            // Verificar si el código ya existe
            if ($this->departamentoModel->codigoExists($codigo)) {
                return view('admin/crear_departamento', $data)->with('errors', ['codigo' => 'El código ya existe.']);
            }

            $rules = [
                'nombre' => 'required|min_length[2]|max_length[100]',
                'codigo' => 'required|min_length[2]|max_length[20]',
            ];

            if (!$this->validate($rules)) {
                return view('admin/crear_departamento', $data)->with('errors', $this->validator->getErrors());
            }

            $this->departamentoModel->insert([
                'nombre' => $this->request->getPost('nombre'),
                'descripcion' => $this->request->getPost('descripcion'),
                'codigo' => $codigo,
                'estado' => 'ACTIVO',
            ]);