app/Controllers/EvaluacionController.php

    public function empleadoDelMes()
    {
        $userId = session()->get('id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        $usuario = $this->usuarioModel->find($userId);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '8'