app/Controllers/HomeController.php

    public function dashboard() {
        // Verificar autenticación
        if (!isset($_SESSION['logged_in']) || !$_SESSION['logged_in']) {
            $this->redirect('/login');
        }

        // Obtener estadísticas
        $stats = [
            'total_personas' => $this->personaModel->count(),
            'total_evaluaciones' => $this->evaluacionModel->count(),
            'total_seguimientos' => $this->seguimientoModel->count(),
            'total_usuarios' => $this->usuarioModel->count()
        ];
---
SELECT COUNT(*) AS `numrows` FROM `evaluaciones`