app/Controllers/HomeController.php

    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Estadísticas
        $statsPersonas = $this->personaModel->getEstadisticas();

        $totalEvaluaciones = $this->evaluacionModel->countAll();
        $totalSeguimientos = $this->seguimientoModel->countAll();

        $seguimientosPendientes = $this->seguimientoModel->where('estado', 'PENDIENTE')->countAllResults();
        $seguimientosProximos = count($this->seguimientoModel->getSeguimientosProximos());

        // Datos para gráficos
        $departamentos = $this->departamentoModel->findAll();
        $labelsDept = [];
        $dataDept = [];
        foreach ($departamentos as $dept) {
            $count = $this->personaModel->where('departamento_id', $dept['id'])
                ->where('estado_registro', 'ACTIVO')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `seguimientos`
SELECT COUNT(*) AS `numrows`
FROM `seguimientos`
WHERE `estado` = 'PENDIENTE'
SELECT *
FROM `departamentos`
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `departamento_id` = '1'
AND `estado_registro` = 'ACTIVO'

        }

        // Distribución por género
        $hombres = $this->personaModel->where('sexo', 'M')->where('estado_registro', 'ACTIVO')->countAllResults();
        $mujeres = $this->personaModel->where('sexo', 'F')->where('estado_registro', 'ACTIVO')->countAllResults();

        // Personas con/sin discapacidad
        $conDiscapacidad = $this->personaModel->where('posee_discapacidad', 'S')->where('estado_registro', 'ACTIVO')->countAllResults();
        $sinDiscapacidad = $this->personaModel->where('posee_discapacidad', 'N')->where('estado_registro', 'ACTIVO')->countAllResults();

        // Estado de seguimientos
        $segPendientes = $this->seguimientoModel->where('estado', 'PENDIENTE')->countAllResults();
        $segEnProceso = $this->seguimientoModel->where('estado', 'EN_PROCESO')->countAllResults();
        $segCompletados = $this->seguimientoModel->where('estado', 'COMPLETADO')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `sexo` = 'M'
AND `estado_registro` = 'ACTIVO'
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `sexo` = 'F'
AND `estado_registro` = 'ACTIVO'
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `posee_discapacidad` = 'S'
AND `estado_registro` = 'ACTIVO'
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `posee_discapacidad` = 'N'
AND `estado_registro` = 'ACTIVO'
SELECT COUNT(*) AS `numrows`
FROM `seguimientos`
WHERE `estado` = 'PENDIENTE'
SELECT COUNT(*) AS `numrows`
FROM `seguimientos`
WHERE `estado` = 'EN_PROCESO'
SELECT COUNT(*) AS `numrows`
FROM `seguimientos`
WHERE `estado` = 'COMPLETADO'

                'carrera' => $carrera,
                'universidad' => $universidad,
            ],
            'seguimientos_recientes' => $this->seguimientoModel
                ->orderBy('created_at', 'DESC')
                ->limit(5)
                ->findAll(),
---
SELECT *
FROM `seguimientos`
ORDER BY `created_at` DESC
 LIMIT 5