app/Controllers/PersonaController.php

    public function index()
    {
        $busqueda = $this->request->getGet('q');
        $perPage = $this->request->getGet('perPage') ?? 25;
        $rol = session()->get('rol');
        $departamentoId = session()->get('departamento_id');

        $perPage = in_array($perPage, [10, 25, 50, 100]) ? $perPage : 25;

        if ($rol === 'ADMIN' || $rol === 'EVALUADOR') {
            if ($busqueda) {
                $personas = $this->personaModel
                    ->groupStart()
                    ->like('primer_nombre', $busqueda)
                    ->orLike('primer_apellido', $busqueda)
                    ->orLike('cedula', $busqueda)
                    ->orLike('correo_electronico', $busqueda)
                    ->groupEnd()
                    ->where('estado_registro', 'ACTIVO')
                    ->orderBy('primer_apellido', 'ASC')
                    ->paginate($perPage);
            } else {
                $personas = $this->personaModel
                    ->where('estado_registro', 'ACTIVO')
                    ->orderBy('primer_apellido', 'ASC')
                    ->paginate($perPage);
---
SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
ORDER BY `primer_apellido` ASC
 LIMIT 90, 15
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'

            }
        }

        $data = [
            'title'     => 'Lista de Personas',
            'personas'  => $personas,
            'pager'     => $this->personaModel->pager,
            'busqueda'  => $busqueda,
            'perPage'   => $perPage,
            'departamentos' => $this->departamentoModel->findAll(),
        ];
---
SELECT *
FROM `departamentos`

    public function edit($id = null)
    {
        $persona = $this->personaModel->find($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '28'