app/Models/DepartamentoModel.php

SELECT *
FROM `departamentos`
WHERE `estado` = 'ACTIVO'
---
    public function getDepartamentosActivos()
    {
        return $this->where('estado', 'ACTIVO')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `departamentos`
WHERE `codigo` = 'RECP'
---
    public function codigoExists($codigo, $excludeId = null)
    {
        $builder = $this->where('codigo', strtoupper($codigo));
        if ($excludeId) {
            $builder->where('id !=', $excludeId);
        }
        return $builder->countAllResults() > 0;