app/Models/EvaluacionModel.php

    public function getEmpleadoDelMes($mes = null)
    {
        if (!$mes) {
            $mes = date('Y-m');
        }

        return $this->select('evaluaciones.*, personas.primer_nombre, personas.primer_apellido, personas.cedula')
                    ->join('personas', 'personas.id = evaluaciones.persona_id')
                    ->where('evaluaciones.mes_evaluado', $mes)
                    ->where('evaluaciones.es_empleado_mes', 'S')
                    ->first();
---
SELECT `evaluaciones`.*, `personas`.`primer_nombre`, `personas`.`primer_apellido`, `personas`.`cedula`
FROM `evaluaciones`
JOIN `personas` ON `personas`.`id` = `evaluaciones`.`persona_id`
WHERE `evaluaciones`.`mes_evaluado` = '2026-04'
AND `evaluaciones`.`es_empleado_mes` = 'S'
 LIMIT 1

    public function getCandidatosEmpleadoDelMes($mes = null, $limite = 5)
    {
        if (!$mes) {
            $mes = date('Y-m');
        }

        return $this->select('evaluaciones.*, personas.primer_nombre, personas.primer_apellido, personas.cedula')
                    ->join('personas', 'personas.id = evaluaciones.persona_id')
                    ->where('evaluaciones.mes_evaluado', $mes)
                    ->where('evaluaciones.tipo_evaluacion', 'MENSUAL')
                    ->orderBy('evaluaciones.puntuacion', 'DESC')
                    ->limit($limite)
                    ->findAll();
---
SELECT `evaluaciones`.*, `personas`.`primer_nombre`, `personas`.`primer_apellido`, `personas`.`cedula`
FROM `evaluaciones`
JOIN `personas` ON `personas`.`id` = `evaluaciones`.`persona_id`
WHERE `evaluaciones`.`mes_evaluado` = '2026-04'
AND `evaluaciones`.`tipo_evaluacion` = 'MENSUAL'
ORDER BY `evaluaciones`.`puntuacion` DESC
 LIMIT 5