app/Models/PersonaModel.php

SELECT COUNT(*) AS `numrows` FROM `personas`
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticas()
    {
        $total = $this->countAll();
        $activos = $this->where('estado_registro', 'ACTIVO')->countAllResults();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasEstadoCivil($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasEdad($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasNacionalidad($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasEstado($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasMunicipio($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasComuna($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasParroquia($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasNivelAcademico($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasBeca($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasTipoUniversidad($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasCarrera($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();

SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
---
    public function getEstadisticasUniversidad($departamentoId = null)
    {
        $builder = $this->where('estado_registro', 'ACTIVO');
        if ($departamentoId) {
            $builder->where('departamento_id', $departamentoId);
        }

        $personas = $builder->findAll();