app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `username` = 'admin@aurys.com'
OR `email` = 'admin@aurys.com'
 LIMIT 1
UPDATE `usuarios` SET `ultimo_login` = '2026-05-28 13:59:29', `updated_at` = '2026-05-28 13:59:29'
WHERE `usuarios`.`id` IN ('1')
---
    public function verifyCredentials($username, $password)
    {
        $usuario = $this->where('username', $username)
                       ->orWhere('email', $username)
                       ->first();

        if ($usuario && password_verify($password, $usuario['password'])) {
            // Actualizar último login
            $this->update($usuario['id'], ['ultimo_login' => date('Y-m-d H:i:s')]);

SELECT *
FROM `usuarios`
WHERE `username` = 'admin@aurys.com'
OR `email` = 'admin@aurys.com'
 LIMIT 1
---
    public function isLocked(string $username): bool
    {
        $usuario = $this->where('username', $username)
                       ->orWhere('email', $username)
                       ->first();

SELECT *
FROM `usuarios`
WHERE `username` = 'admin@aurys.com'
OR `email` = 'admin@aurys.com'
 LIMIT 1
---
    public function recordFailedAttempt(string $username): void
    {
        $usuario = $this->where('username', $username)
                       ->orWhere('email', $username)
                       ->first();

UPDATE `usuarios` SET `failed_login_attempts` = 0, `locked_until` = NULL, `updated_at` = '2026-05-28 13:59:29'
WHERE `usuarios`.`id` IN (1)
---
    public function resetFailedAttempts(int $userId): void
    {
        $this->update($userId, [
            'failed_login_attempts' => 0,
            'locked_until'         => null,
        ]);

SELECT *
FROM `usuarios`
WHERE `username` = 'admin@aurys.com'
OR `email` = 'admin@aurys.com'
 LIMIT 1
---
    public function getIntentsLeft(string $username): ?int
    {
        $usuario = $this->where('username', $username)
                       ->orWhere('email', $username)
                       ->first();